Documents/бит_УстановкаРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаРаспределения</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
				<xr:Item>InformationRegister.бит_РаспределенияНаУслугах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкаРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_РаспределенияНаУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_РаспределенияНаУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ШаблоныУслуг</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацийУстановкаРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийУстановкаРаспределения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаРаспределения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеРаспределения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СпособыРасчетаПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СпособыРасчетаПоУслугам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикамСНаличиемИндивидуальных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницамПотребленияНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницамПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЖилойПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИндивидуальнымСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОбщейПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОтапливаемойПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроживающим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроживающимСНормативом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРаспределению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоСчетчикам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_УстановкаРаспределения/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , мКэшЗначений.ВидОперации);
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
																,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Вызов механизма разделения прав доступа.
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ, СтандартнаяОбработка, ДокументОбъект, ЭтаФорма);
	
	// БИТ_ЖКХ 24.08.2016 17:56:41 Начало правки...
	Массив = Новый Массив();
	Массив.Добавить(Тип("СправочникСсылка.бит_Проживающие"));
	ОписаниеТипаПроживающие = Новый ОписаниеТипов(Массив);
	Элементы.ЛицевыеСчетаОтветственноеЛицо.ОграничениеТипа = ОписаниеТипаПроживающие;
	// БИТ_ЖКХ 24.08.2016 17:56:41 Конец правки.
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьЗаголовокФормыДокумента();
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
	Если Не Параметры.Ключ.Пустая() Тогда
		
	    Элементы.Объект.ТолькоПросмотр        = Истина;
	    Элементы.Распределение.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Элементы.ЛицевыеСчета.ТолькоПросмотр = Объект.Проведен;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если НЕ ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьЛицевыеСчетаНаСервере2(ВыбранноеЗначение.АдресЛСВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
	Элементы.ЛицевыеСчета.ТолькоПросмотр  = Объект.Проведен;

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Объект) Тогда
	
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Поле ""Объект"" не заполнено!");
	    Возврат;
		
	КонецЕсли; 
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"       , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация"));
	ПараметрыФормы.Вставить("Дата"              , Объект.Дата);
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	ПараметрыФормы.Вставить("Здание"            , Объект.Объект);
	ПараметрыФормы.Вставить("Улица"             , ПолучитьУлицуЗданияНаСервере(Объект.Объект));
	
	СписокУслуг = ПолучитьСписокУслугНаСервере2();
		
	ПараметрыФормы.Вставить("СписокУслуг", СписокУслуг);
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ПредыдущийВидОперации = мКэшЗначений.ВидОперации; // Сохраним пред видОперациия для его сравнения с новым.
		
	// Если операция не поменялась то выходим.
	Если ПредыдущийВидОперации = Объект.ВидОперации Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мКэшЗначений.ВидОперации = Объект.ВидОперации;
	
	// Отобразить в заголовке формы вид операции.
	УстановитьЗаголовокФормыДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	Объект.ЛицевыеСчета.Очистить();
	
	Объект.Распределение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПриИзменении(Элемент)
	
	Отмена = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Распределение) Тогда
		
		ПроверитьРаспределение(Отмена, Объект.Распределение, КонецДня(Объект.Дата), Объект.Объект, Объект.ВидОперации);
		
	КонецЕсли;
	
	Если Отмена Тогда
		
		Объект.Распределение = Неопределено;
		
		Возврат;	
		
	КонецЕсли; 
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения") Тогда
		
		Объект.ЛицевыеСчета.Очистить();
		
	Иначе
		
		ЗаполнитьЛицевыеСчетаНаСервере();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Объект = Неопределено Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не выбран объект для установки распределения!");
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не выбран вид операции!");
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения") Тогда
			
		// Заполняем список исключений.
		СписокРаспределений = ПолучитьСписокРаспределений(КонецДня(Объект.Дата), Объект.Объект, Объект.ВидОперации);
		
		Отбор = Новый Структура;
		
		Если СписокРаспределений.Количество() > 0 Тогда
			
			Отбор.Вставить("Ссылка", СписокРаспределений);
			
		Иначе
			
			Отбор.Вставить("Ссылка", Неопределено);
			
		КонецЕсли;
		
		ОткрытьФорму("Справочник.бит_Распределения.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаУстановкаРаспределенияНеВСписке", Отбор), Элемент);
				
	Иначе
		
		СписокРаспределений = ПолучитьСписокРаспределений(КонецДня(Объект.Дата), Объект.Объект, Объект.ВидОперации);
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Ссылка", СписокРаспределений);

		ОткрытьФорму("Справочник.бит_Распределения.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаУстановкаРаспределенияВСписке", Отбор), Элемент);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ЛицевыеСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Объект.Распределение = ПредопределенноеЗначение("Справочник.бит_Распределения.ПустаяСсылка") Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не выбрано распределение!");
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаУслугаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	лСписокУслуг = ПолучитьСписокУслугНаСервере(Объект.ВидОперации, КонецМесяца(Объект.Дата), Объект.Объект, Объект.Распределение);
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Ссылка", лСписокУслуг);
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаУстановкаРаспределения", Отбор), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	НомерСтр = Объект.ЛицевыеСчета.НайтиПоИдентификатору(Элементы.ЛицевыеСчета.ТекущаяСтрока).ИсходныйНомерСтроки;
	
	ПроверитьИЗаполнитьСтрокуЛСНаСервере(Объект.Дата, ТекДанные.ЛицевойСчет, ТекДанные.Услуга, Объект.Объект, НомерСтр);

КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Отбор = Новый Структура;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения") Тогда
		
		Отбор.Вставить("Здание", Объект.Объект);
		
	Иначе
		
		СписокЛС = ПолучитьСписокЛСНаСервере(Объект.Дата, Объект.Распределение);
		
		Отбор.Вставить("Ссылка", СписокЛС);
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура выполняет проверку ведения учета по распределению.
//
&НаСервереБезКонтекста
Процедура ПроверитьРаспределение(Знач Отмена, Знач Распределение, Знач Дата, Знач ОбъектОбъект, Знач ВидОперации)

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"         , Дата);
	Запрос.УстановитьПараметр("Распределение", Распределение);
	Запрос.УстановитьПараметр("Объект"       , ОбъектОбъект);
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения") Тогда
		
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_РаспределенияНаУслугахСрезПоследних.Объект КАК Объект,
			|	бит_РаспределенияНаУслугахСрезПоследних.Распределение КАК Распределение
			|ИЗ
			|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Дата, Распределение = &Распределение) КАК бит_РаспределенияНаУслугахСрезПоследних
			|ГДЕ
			|	бит_РаспределенияНаУслугахСрезПоследних.Использовать
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_РаспределенияНаУслугахСрезПоследних.Объект,
			|	бит_РаспределенияНаУслугахСрезПоследних.Распределение";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Выборка.Следующий();
			
			Если НЕ Запрос.Выполнить().Пустой() Тогда
				
				Отмена = Истина;
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Распределение: """ + Распределение + """ уже заведено на здании: " + Выборка.Объект + "!");
				
			КонецЕсли;
		
	Иначе	
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_РаспределенияНаУслугахСрезПоследних.Объект КАК Объект,
			|	бит_РаспределенияНаУслугахСрезПоследних.Распределение КАК Распределение,
			|	бит_РаспределенияНаУслугахСрезПоследних.Использовать
			|ИЗ
			|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
			|			&Дата,
			|			Распределение = &Распределение) КАК бит_РаспределенияНаУслугахСрезПоследних
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_РаспределенияНаУслугахСрезПоследних.Объект,
			|	бит_РаспределенияНаУслугахСрезПоследних.Распределение,
			|	бит_РаспределенияНаУслугахСрезПоследних.Использовать";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Выборка.Следующий();
			
			Если НЕ Запрос.Выполнить().Пустой() Тогда
				
				Если НЕ Выборка.Использовать Тогда
					
					Отмена = Истина;
					
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Распределение: """ + Распределение + """ не установлено! Снятие невозможно");
					
				КонецЕсли; 
				
			Иначе
				
				Отмена = Истина;
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Распределение: """ + Распределение + """ не зарегистрировано! Снятие невозможно.");
				
			КонецЕсли;
			
	КонецЕсли; 

КонецПроцедуры
 
// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
		
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Дата"                , Объект.Дата);
	КэшированныеЗначения.Вставить("ВидОперации"         , Объект.ВидОперации);
	КэшированныеЗначения.Вставить("мПоставщик"          , Справочники.бит_ПоставщикиУслуг.ПустаяСсылка());
    КэшированныеЗначения.Вставить("мРежимПотребления"   , Справочники.бит_РежимыПотребленияУслуг.ПустаяСсылка());
    КэшированныеЗначения.Вставить("мСпособРасчета"      , Перечисления.бит_СпособыРасчетаПоУслугам.ПустаяСсылка());

КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛицевыеСчетаНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"         , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Объект"       , Объект.Объект);
	Запрос.УстановитьПараметр("Распределение", Объект.Распределение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
	|			&Дата,
	|			Объект = &Объект
	|				И Распределение = &Распределение) КАК бит_РаспределенияНаУслугахСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|ГДЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга";
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Объект.ЛицевыеСчета.Очистить();
	
	Пока Выборка.Следующий() Цикл			
		
		СтрокаЛС                   = Объект.ЛицевыеСчета.Добавить();
		СтрокаЛС.Услуга            = Выборка.Услуга;
		СтрокаЛС.ЛицевойСчет       = Выборка.ЛицевойСчет;
		СтрокаЛС.ОтветственноеЛицо = Выборка.ФизЛицо;
		СтрокаЛС.Адрес             = Строка(Выборка.ЛицевойСчет.УлицаЛицевогоСчета) + ", " + Строка(Выборка.ЛицевойСчет.Здание);
		
	КонецЦикла;

КонецПроцедуры

// Функция формирует список исключения распределений.
//
&НаСервереБезКонтекста
Функция ПолучитьСписокРаспределений(Знач Дата, Знач Объект, Знач ВидОперации)
	
	СписокРаспределений = Новый СписокЗначений;
	
	УсловиеОбъект = ?(ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаРаспределения.СнятиеРаспределения"), " Объект = &Объект", "");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_РаспределенияНаУслугахСрезПоследних.Объект,
	|	бит_РаспределенияНаУслугахСрезПоследних.Распределение
	|ИЗ
	|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
	|			&Дата," + УсловиеОбъект + ") КАК бит_РаспределенияНаУслугахСрезПоследних
	|ГДЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Использовать";
	
	Запрос.УстановитьПараметр("Дата"  , Дата); 
	Запрос.УстановитьПараметр("Объект", Объект); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокРаспределений.Добавить(Выборка.Распределение);
		
	КонецЦикла; 
	
	Возврат СписокРаспределений;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьСписокУслугНаСервере(Знач ВидОперации, Знач Дата, Знач ОбъектОбъект, Знач Распределение);
	
	Запрос = Новый Запрос;

	Если ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения") Тогда
	
		
		Запрос.УстановитьПараметр("Момент"         , Дата);
		Запрос.УстановитьПараметр("Объект"         , ОбъектОбъект);
		Запрос.УстановитьПараметр("ПоРаспределению", ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению"));
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ШаблоныУслугСрезПоследних.Услуга
		|ИЗ
		|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
		|			&Момент,
		|			Здание = &Объект
		|				И Услуга.СпособыРасчета.СпособРасчета = &ПоРаспределению) КАК бит_ШаблоныУслугСрезПоследних";
			
	Иначе
		
		Запрос.УстановитьПараметр("Дата"         , Дата);
		Запрос.УстановитьПараметр("Объект"       , ОбъектОбъект);
		Запрос.УстановитьПараметр("Распределение", Распределение);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	бит_РаспределенияНаУслугахСрезПоследних.Услуга
		               |ИЗ
		               |	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
		               |			&Дата,
		               |			Объект = &Объект
		               |				И Распределение = &Распределение) КАК бит_РаспределенияНаУслугахСрезПоследних";
				
	КонецЕсли;
	
	лСписокУслуг = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		
		лСписокУслуг.Добавить(Выборка.Услуга);	
		
	КонецЦикла;
	
	Возврат лСписокУслуг;
	
КонецФункции

&НаСервере
Процедура ПроверитьИЗаполнитьСтрокуЛСНаСервере(Знач Дата, Знач ЛицевойСчет, Знач Услуга, Знач ОбъектОбъект, Знач НомерСтр);
	
	Данные         = РеквизитФормыВЗначение("Объект");
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.ПроверитьИЗаполнитьСтрокуЛС(Дата, ЛицевойСчет, Услуга, ОбъектОбъект, Данные.ЛицевыеСчета[НомерСтр]);
		
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ЗначениеВРеквизитФормы(Данные,"Объект");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЛСНаСервере(Знач Дата, Знач Распределение);
	
	СписокЛС = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"         ,Дата);
	Запрос.УстановитьПараметр("Распределение",Распределение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Дата, Распределение = &Распределение) КАК бит_РаспределенияНаУслугахСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокЛС.Добавить(Выборка.ЛицевойСчет);
		
	КонецЦикла;
	
	Возврат СписокЛС;
	
КонецФункции
	
// БИТ_ЖКХ 13.10.2011 Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Функция ПолучитьУлицуЗданияНаСервере(Знач Здание)
	
	Возврат Здание.Улица;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокУслугНаСервере2()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УслугиЖКХ.Ссылка КАК Услуга
	|ИЗ
	|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|ГДЕ
	|	бит_УслугиЖКХ.СпособыРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокУслуг = Новый СписокЗначений;
	
	СписокУслуг.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокУслуг;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЛицевыеСчетаНаСервере2(АдресЛСВХранилище);
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(АдресЛСВХранилище);
	
	Отбор = Новый Структура;
	
	Для каждого Строка Из ТаблицаЛС Цикл

		Отбор.Вставить("Услуга"     , Строка.Услуга);
		Отбор.Вставить("ЛицевойСчет", Строка.ЛицевойСчет);
		
		СтрокиПоиска = Объект.ЛицевыеСчета.НайтиСтроки(Отбор);
		
		Если СтрокиПоиска.Количество() > 0 Тогда
			
			Отбор.Удалить("ЛицевойСчет");
			Отбор.Удалить("Услуга");
			
			Продолжить;
			
		КонецЕсли;
		
		Данные         = РеквизитФормыВЗначение("Объект");
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		НоваяСтрока = Данные.ЛицевыеСчета.Добавить();
		
		НоваяСтрока.ЛицевойСчет = Строка.ЛицевойСчет;
		НоваяСтрока.Услуга      = Строка.Услуга;
		
		НоваяСтрока.ОтветственноеЛицо      = ОтветственныйНаЛС(Строка.ЛицевойСчет);
		НоваяСтрока.Адрес = Строка(Строка.ЛицевойСчет.УлицаЛицевогоСчета) + ", " + Строка(Строка.ЛицевойСчет.Здание);;
		
		ДокументОбъект.ПроверитьИЗаполнитьСтрокуЛС(Объект.Дата, Строка.ЛицевойСчет, Строка.Услуга, Объект.Объект, НоваяСтрока);
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ЛицевойСчет) Тогда
			
			Данные.ЛицевыеСчета.Удалить(НоваяСтрока);
			
		КонецЕсли;
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
        ЗначениеВРеквизитФормы(Данные,"Объект");

		Отбор.Удалить("ЛицевойСчет");
		Отбор.Удалить("Услуга");
		
	КонецЦикла;
	
КонецПроцедуры

// Функция Получение ответственного на выбранном ЛС.
// Параметры:
//  <ЛицевойСчет> – <Справочник.бит_ЛицевыеСчета> – для получения ответственного по ЛС.
//
// Возвращаемое значение:
//   <ТаблицаЗначений.Строка> – <строка с ответственным по ЛС>.
//
&НаСервере
Функция ОтветственныйНаЛС(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ЛицевыеСчета.Ссылка
	|				ИЗ
	|					Справочник.бит_ЛицевыеСчета КАК ЛицевыеСчета
	|				ГДЕ
	|					ЛицевыеСчета.Ссылка = &ЛицевойСчет)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	
	Запрос.УстановитьПараметр("Момент", 	 ТекущаяДата());
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()> 0 Тогда
		
		РезультатФизЛицо = Результат[0].ФизЛицо
	Иначе
		РезультатФизЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФизЛицо;
	
КонецФункции // 

#КонецОбласти
